// lib/mountains_page.dart
import 'package:flutter/material.dart';
import '../services/search_service.dart'; // اضافه شد

class MountainsPage extends StatelessWidget {
  const MountainsPage({Key? key}) : super(key: key);

  Text _title(String text) {
    return Text(
      text,
      style: const TextStyle(
        fontSize: 18,
        fontWeight: FontWeight.bold,
        color: Color(0xFFB00020),
      ),
    );
  }

  Text _content(String text) {
    return Text(
      text,
      textAlign: TextAlign.justify,
      style: const TextStyle(
        fontSize: 16,
        color: Colors.black87,
        height: 1.5,
      ),
    );
  }

  void _registerForSearch() {
    final service = SearchService();
    
    StringBuffer fullText = StringBuffer();
    fullText.writeln('مناطق اطراف روستای ایراج:');
    fullText.writeln();
    
    fullText.writeln('اطراف جاده خنج (سمت جنوب شرقی) از ایرج تا حوالی منک:');
    fullText.writeln('بيسار سياه، دشت باغ حلقه، كلوتا باغ (تلا باغ)، جاه بومونو، حوض دومو، بوكندهاى شيوو، كوه شيوو، حوض حسين مراد، حوض كلو (kello)، بوكند جعفر، بوكنداى دوره، كود كهر (geher)، كوه رش، سنكاب كوه رش، جاه سيد احمد (يا قله سليمون)');
    fullText.writeln();
    
    fullText.writeln('اطراف راه منک (سمت جنوب) از ایرج تا منک و حوالی بهین:');
    fullText.writeln('چیل اسبى، رودخونه خارى، تل محب، بيسار سياه، رودخانه كنج، سينه سياه، رودخانه بازارو، سينه كنون، بوكند حاج محمد، راه بهينى ها، بوكند سردر، رودخانه بادومى، سنك تسبيح، عرش كرون بالا، عرش كرون پايين، كدار مَمبارك، ريزابو پاى كدار ممبارك، رودخانه سوهونو، قله سليمون، خاك وزيرو، رودخانه سنجدو، معدنو، قاش معدنو، ته دهنه، كدار پايين، ميل آسمون، كدار بالا، كَدار جاه كود الو، باغچه وو منك (يشت كوه منك)، كال شيطون، كال عبد العلى، بيوال شتر، مزارو، جشمه وو، منك، كنتى يو، قله صوفه، غار صوفه، قله آدمو، قله پيشرو، قاش خاكشيرى، كَزو، جاه هاى كُند آباد، كالو مرغى، آب بنه وو، اسلام دشت، زردو، جمون، معادن كج، شورو، كال سرخ، كدار نَدى، كَدار سبزه (به طرف بهين)');
    fullText.writeln();
    
    fullText.writeln('اطراف راه بهین و آخری (سمت جنوب ایرج) از ایرج تا بهین و آخری تا کدار زایین و نهایتا کوه سم:');
    fullText.writeln('بيسار سرخو، جاه آب آشاميدنى ايراج، حوض حاج على، چيل عمر، زيارت درد دل، بوكند حاج محمد، لخت آسيو، تلو دم دره بهين، بوكند حاج محمد، لَخَرو، كال مومنايى، كركينو، بهين، پا پرده، اوهومو، آبكيشه، ا وبيدو، كوه بهين، سر تخت بالا و پايين، سر كوه بهين (نيـزه بـازو)، تخت مسعود لشكر، آغالا ارباب، كدارو آخرك، نوو زنكى يو، نوو بلنكى يو، بوكند حاج محمد، لوند بزرك، نوكزى، سنكاب مرغى، كدار بندر فل، كدارو چاه يوسف قلى، كدار دُهُل جنون، آخرى، كَدارو آخرك، قاش فراق، آسونه قاش فراق، قاش قنبر، دُهُل جنون، سنكَاب دهل جنون، كودال دهل جنون، قاش مومنايى، سوراخ مومنايى، آسونه مومنايى، كودال مومنايى، كالو مرغى، دهنه زايين، قاش حسين ملك، آب زايين، چشمه شيرينو، كدار زايين، عمامه سرو، كلچو، سنكَاب سكـ، كالو كبلا حسين، درههاى آبى، سنكاب ريواسى، كدار دره هاى آبى، تيغه زرد، قاش موسى على، يك سنكو، كدارو يه سنكو، قله عاشقون، بوكند حاج محمد، دهنه أُزّو، قاش هفتاد راه، نُوا تار، قاش كج، كالو ارديبيا، قاشا سبزى، كودال بياضه ايى ها، كدار دوموو، سرخوواى سر كدار، داله مند، كدار واكفت، بوكند دولون، تيغه چغا، دَق چغا، رودخونه چاه، بيخ چاه، سنكاباى ميشور، كال زَنا، كال قادمه خانم، كال روباه، تيغه زرد، سنكاب هاى جفتى، تل سفيد، كدار قبر مجناوو، كَدار آب يوزكون، آب يوزكون، كوه سفيدو، كَلون سرخو، سنكَاب كَلون سرخو، كال كَلون سرخو، كَدار كَل محمد، سَرسَره سيـاوون، كال عبدل، كدار بوسون، بوسوون، لُندِسّون، بوكند حاج محمد، نوو سيب زار، ريزه مال، خَرَتُو، چاه كَندمى، جُر تنكَو، بند اكبر مندعلى، دره خرتو، كال سياوون، قاش عباس، سنكاب درز، كوه سفيد');
    fullText.writeln();
    
    fullText.writeln('قسمت غربی ایرج حد فاصل کوه سم تا سد حسین‌آباد:');
    fullText.writeln('تل مَغَل، آغال سِكَين، كوه سم، كوچه هاى سَم، حوض حاج على، كوه شاه مدد، كتل جغاتكون، كوچه لُوو، كودى جغاتكون، رودخونه كولار، آتشكده، بندكولار، كَولار، تلا كولار، دهنه كَرّو، آغالا اسدالله، سنكَاب على زيبا، كوه سنجد، ميون كوه سنجد، كدار دال، كَدار سك دوون، كدار نو عابدين، كال شرف، درد دل، كوجه هاى دم درد دل، قاش بلوچا، كتل خاك نرمو، كرمكوه، خرم آباد، كدار ايراج، حوض دم كدار، دمب نخودو، كوجه ساباطو، سنك حسنى، دره زيارت، حوض حاج محمد دانا، ميون كوه زيارت، كج زاغو، دو راه چشمه سنجد، بشت كِجِه نَكَون، رودخونه كدار دال، سنكاب نو عابدين، چشمه سنجد، خرمَنكوه، قله تاشِر، باغو جرون، دره كَرو چشمه سنجد، كَرو چشمه سنجد، دره تارو، رودخونه بيخ سياوون، كوه سفيد، كال كفترا، جركن محمد ابراهيم، كدار ترخى، كدار بوسون، كال بيكى، جاه كبلا محمد عوض، دره سفيد، سنكاب دره سفيد، جاه حسين رضا، باغو كولار، تل خركوش، سد حسين آباد، حوضو دم حسين آباد');
    fullText.writeln();
    
    fullText.writeln('سمت غربی ایرج حد فاصل مزار کبرا تا آبکادو و آفرین تا بشت برج:');
    fullText.writeln('مزار كبرا، آرت كندمى، زايينه يا تخت كوه، تخت كوه، رودخونه كودال، معدنو، كالو جمشيد، سنكاب سال، كتل زاغو، آبكادو، كدارو سرخو، كَرت خالق، بند جيل، كال جُنمادو، سختون جُنمادو، كوجه بونو، دره انبار سبز، كال سبز، چشمه هنريه، كَدار آفرين، زُرُمو، آفرين، چيل آفرين، دَق آفرين، سلام آبكرم، خندق ميون، دره آفرين، كوه كمر بلند، برج، زاينه يشت برج، كدار زاركون، كل سفيد، دره سنكابو');
    fullText.writeln();
    
    fullText.writeln('سمت شمال ایرج، حد فاصل راه کلاته تا سنکاب خان (بالای اردیب):');
    fullText.writeln('كتل زيارت، چشمه على اكبر، آسونه انجيرى، كرده نو الله، دمباله ميرزا حسن، سينه كال، رودخونه شغالو، تلوها، أوشكو (كاشفيه - اشرفيه)، أُوو، كال كالى، آغال قندى، آغال كبلا كريم، دُمب چاله باغ، تل مزار، بوكند سياوو، كوه سياوو، كلاته، كوه كلاته، بيدوا، كلاته بالا، كلاته نُو، كتل زاينه اى، چشمه شغالو، كُهين، بونه كُهين، دره كَزين، سنكَاب كوله، آسونه طالب، ايجُنووا، حَكُوه، قاش حسن موندكار، نوو قيچى، كَمَنو، شهون، كوچه تارو، عباس بريده، شهربانو بريده، كنجعلى بخش، سنكاب خان');
    fullText.writeln();
    
    fullText.writeln('مناطق بشت كوه از سمت كوه بياضه:');
    fullText.writeln('كَدار سورى، آبكرم، قله دختر، سنكَابا لودَر، لا خراسونى، چاه شور، آب تلخو، تنكّل پايين، تنكّل بالا، معدن ناتوتيا، خرما وو، قله عوض، كوه بَلورو، جاه قاسم سراج، كدار خاكو، چشمه سيد حسن، قاشا جاجايى، حاجى آبادى، نيوو بشت كدار زايين، چشمه غلومرضا ابو الحسن، شاه حسين، خرما وو، جشمه قنبر، جشمه كوجه راه، نيوو رييس، معدن مس، كَنِكُو، خندقو، آسونه تل بادى، كُنُكَون، دومو، كلاته ميرزا، بُندَر، دار بستو، كَود ال عباس محمد حسن، كُورُو، آب نُو، آب كَنون، تنكَه آب كَنون، چشمه براتعلى، هنشينو، چاكنار، جشمه آخرو، چشمه چسيو، وبه سمت انارى');
    
    service.registerItem(
      SearchItem(
        title: 'مناطق اطراف',
        subtitle: 'کوه‌ها، دشت‌ها و مناطق اطراف روستا',
        searchText: fullText.toString(),
        page: const MountainsPage(),
        icon: Icons.terrain,
        category: 'طبیعت',
      ),
    );
  }

  @override
  Widget build(BuildContext context) {
    WidgetsBinding.instance.addPostFrameCallback((_) {
      _registerForSearch();
    });

    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        appBar: AppBar(
          title: const Text("مناطق اطراف روستا"),
        ),
        body: SingleChildScrollView(
          padding: const EdgeInsets.all(16),
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              _title("اطراف جاده خنج (سمت جنوب شرقی) از ایرج تا حوالی مَنک"),
              _content(
                '''بيسار سياه ، دشت باغ حلقه ، كلوتا باغ ( تلا باغ) ، جاه بومونو ، ، حوض دومو ، بوكندهاى شيوو ، كوه شيوو ، حوض حسين مراد ، حوض كلو (kello) ، بوكند جعفر ، بوكنداى دوره ، كود كهر ( geher) ، كوه رش ، سنكاب كوه رش ، جاه سيد احمد ( يا قله سليمون )'''
              ),
              const SizedBox(height: 20),
              
              _title("اطراف راه مَنک (سمت جنوب) از ایرج تا مَنک و حوالی بهین"),
              _content(
                '''چیل اسبى ، رودخونه خارى ، تل محب ، بيسار سياه ، رودخانه كنج ، سينه سياه ، رودخانه بازارو ، سينه كنون ، بوكند حاج محمد ، راه بهينى ها ، بوكند سردر ، رودخانه بادومى ، سنك تسبيح ، عرش كرون بالا ، عرش كرون پايين ، كدار مَمبارك ، ريزابو پاى كدار ممبارك ، رودخانه سوهونو ، قله سليمون ، خاك وزيرو ، رودخانه سنجدو ، معدنو ، قاش معدنو ، ته دهنه ، كدار پايين ، ميل آسمون ، كدار بالا ، كَدار جاه كود الو ( كمو ، سد ، دريا ، بيدستون ، سنكاب لوتار ، لا خراسونى وبه طرف خنج ) ... باغچه وو منك ( يشت كوه منك ) ... كال شيطون ، كال عبد العلى ، بيوال شتر ، مزارو ، جشمه وو ، منك ، كنتى يو ( محفظه اى شبيه كندو ، احداثى در دل صخره ، جهت نكهدارى و محفوظ نكه داشتن حبوبات از دست راهزنان در قديم ) ، قله صوفه ، غار صوفه ، قله آدمو ، قله پيشرو ، قاش خاكشيرى ، كَزو ، جاه هاى كُند آباد ( احداثى توسط مرحوم حاج ميرزا على زاهد ) ، كالو مرغى ، آب بنه وو ، اسلام دشت ، زردو ، جمون ، معادن كج ، شورو ، كال سرخ ، كدار نَدى ، كَدار سبزه ( به طرف بهين ) ....'''
              ),
              const SizedBox(height: 20),
              
              _title("اطراف راه بهین و آخری (سمت جنوب ایرج) از ایرج تا بهین و آخری تا کدار زایین و نهایتا کوه سَم"),
              _content(
                '''بيسار سرخو ، جاه آب آشاميدنى ايراج ، حوض حاج على ، چيل عمر ، زيارت درد دل ، بوكند حاج محمد ، لخت آسيو ، تلو دم دره بهين ، بوكند حاج محمد ، لَخَرو ، كال مومنايى ، كركينو ، بهين ، پا پرده ، اوهومو ( ovhomoo)، آبكيشه، ا وبيدو (ovbidoo) ، كوه بهين ، سر تخت بالا و پايين ، سر كوه بهين ( نـيـزه بـازو ) ، تخت مسعود لشكر، ... آغالا ارباب، كدارو آخرك ، نوو ( nov) زنكى يو ، نوو بلنكى يو ، بوكند حاج محمد ، لوند بزرك ، نوكزى ، سنكاب مرغى ، كدار بندر فل ، كدارو چاه يوسف قلى ، كدار دُهُل جنون ، آخرى ، كَدارو آخرك ، قاش فراق ، آسونه قاش فراق، قاش قنبر ، دُهُل جنون ، سنكَاب دهل جنون ، كودال دهل جنون ، قاش مومنايى ، سوراخ مومنايى ، آسونه مومنايى ، كودال مومنايى ، كالو مرغى ، دهنه زايين ، قاش حسين ملك ، آب زايين ، چشمه شيرينو ، كدار زايين ، عمامه سرو ( منديل سرو ) ، كلچو ، سنكَاب سكـ ، كالو كبلا حسين ، درههاى آبى ، سنكاب ريواسى ، كدار دره هاى آبى ، تيغه زرد ، قاش موسى على ، يك سنكو (سنكاب )، كدارو يه سنكو ، قله عاشقون ، ... بوكند حاج محمد ، دهنه أُزّو ، قاش هفتاد راه ، نُوا تار ، قاش كج ، كالو ارديبيا ، قاشا سبزى ، كودال بياضه ايى ها ، كدار دوموو ، سرخوواى سر كدار ، داله مند ، كدار واكفت ، .... بوكند دولون ، تيغه چغا ، دَق چغا ، رودخونه چاه ، بيخ چاه، سنكاباى ميشور، كال زَنا، كال قادمه خانم ، كال روباه ، تيغه زرد ، سنكاب هاى جفتى ، تل سفيد ، كدار قبر مجناوو ، كَدار آب يوزكون ، آب يوزكون ، ....
كوه سفيدو ، كَلون سرخو ، سنكَاب كَلون سرخو ، كال كَلون سرخو ، كَدار كَل محمد ، سَرسَره سيـاوون ، كال عبدل ، كدار بوسون ، بوسوون ، لُندِسّون ، بوكند حاج محمد ، نوو سيب زار ، ريزه مال ، خَرَتُو ، چاه كَندمى ، جُر تنكَو ، بند اكبر مندعلى ( در اين محل كندم مى كاشته ) دره خرتو ، كال سياوون ، قاش عباس ، سنكاب درز ، كوه سفيد ...'''
              ),
              const SizedBox(height: 20),
              
              _title("قسمت غربی ایرج حد فاصل کوه سَم تا سد حسین‌آباد"),
              _content(
                '''تل مَغَل ، آغال سِكَين ، كوه سم ، كوچه هاى سَم ، حوض حاج على ، كوه شاه مدد ، كتل جغاتكون ، كوچه لُوو (lovoo)، كودى جغاتكون ، رودخونه كولار ، آتشكده ، بندكولار ، كَولار ، تلا كولار ، دهنه كَرّو ، آغالا اسدالله ، سنكَاب على زيبا ، كوه سنجد ، ميون كوه سنجد .... كدار دال ، كَدار سك دوون ، كدار نو عابدين ، كال شرف ، درد دل ، كوجه هاى دم درد دل ، قاش بلوچا ، كتل خاك نرمو ، كرمكوه ، خرم آباد ، كدار ايراج ، حوض دم كدار ، دمب نخودو ، كوجه ساباطو ، سنك حسنى ، دره زيارت ، حوض حاج محمد دانا ، ميون كوه زيارت ، كج زاغو ، دو راه چشمه سنجد ، بشت كِجِه نَكَون ، رودخونه كدار دال ، سنكاب نو عابدين ، چشمه سنجد ، خرمَنكوه ، قله تاشِر ، باغو جرون ، دره كَرو چشمه سنجد ، كَرو چشمه سنجد ، دره تارو ، رودخونه بيخ سياوون ، كوه سفيد ، كال كفترا ، جركن محمد ابراهيم ، كدار ترخى ، كدار بوسون ، كال بيكى ، جاه كبلا محمد عوض ، دره سفيد ، سنكاب دره سفيد ، جاه حسين رضا ، باغو كولار ، تل خركوش ، سد حسين آباد ، حوضو دم حسين آباد ...'''
              ),
              const SizedBox(height: 20),
              
              _title("سمت غربی ایرج حد فاصل مزار کبرا تا آبکادو و آفرین تا بشت برج"),
              _content(
                '''مزار كبرا ، آرت كندمى ، زايينه يا تخت كوه ، تخت كوه ، رودخونه كودال ، معدنو ، كالو جمشيد ، سنكاب سال ، كتل زاغو ، آبكادو ، كدارو سرخو ، كَرت خالق ، بند جيل ، كال جُنمادو ، سختون جُنمادو ، كوجه بونو ، دره انبار سبز ، كال سبز ، چشمه هنريه، كَدار آفرين، زُرُمو ، آفرين، چيل آفرين ، دَق آفرين ، سلام آبكرم ، خندق ميون ، دره آفرين ، .... كوه كمر بلند ، برج ، زاينه يشت برج ، كدار زاركون ، كل سفيد ، دره سنكابو ٠٠٠٠'''
              ),
              const SizedBox(height: 20),
              
              _title("سمت شمال ایرج ، حد فاصل راه کلاته تا سنکاب خان (بالای اردیب)"),
              _content(
                '''كتل زيارت ، چشمه على اكبر ، آسونه انجيرى ، كرده نو الله، دمباله ميرزا حسن ... سينه كال ، رودخونه شغالو ، تلوها، أوشكو (كاشفيه - اشرفيه) ، أُوو ، كال كالى ، آغال قندى ، آغال كبلا كريم ، دُمب چاله باغ ، تل مزار ... بوكند سياوو ، كوه سياوو ، كلاته ، كوه كلاته ، بيدوا ، كلاته بالا ، كلاته نُو ، كتل زاينه اى ، چشمه شغالو ، كُهين ، بونه كُهين ، دره كَزين ، سنكَاب كوله ، آسونه طالب ، ايجُنووا، حَكُوه chakova ، قاش حسن موندكار ، نوو قيچى ، كَمَنو ، شهون ، كوچه تارو ، عباس بريده ، شهربانو بريده ، كنجعلى بخش ، سنكاب خان'''
              ),
              const SizedBox(height: 20),
              
              _title("مناطق بشت كوه از سمت كوه بياضه"),
              _content(
                '''كَدار سورى ، آبكرم ، قله دختر ، سنكَابا لودَر ، لا خراسونى ، چاه شور، آب تلخو ، تنكّل پايين ، تنكّل بالا ، معدن ناتوتيا ، خرما وو ، قله عوض ، كوه بَلورو ، جاه قاسم سراج ، كدار خاكو ، چشمه سيد حسن ، قاشا جاجايى ، حاجى آبادى ، نيوو بشت كدار زايين ، چشمه غلومرضا ابو الحسن ، شاه حسين ، خرما وو ، جشمه قنبر ، جشمه كوجه راه ، نيوو رييس ، معدن مس ، كَنِكُو ، خندقو ، آسونه تل بادى ، كُنُكَون ، دومو ، كلاته ميرزا ، بُندَر ، دار بستو ، كَود ال عباس محمد حسن ، كُورُو ( goorov)، آب نُو، آب كَنون، تنكَه آب كَنون ، چشمه براتعلى ، هنشينو ، چاكنار ، جشمه آخرو ، چشمه چسيو ، وبه سمت انارى'''
              ),
            ],
          ),
        ),
      ),
    );
  }
}